UT_Marketplaces.Marketplaces/src/InformationRegisters/ДействиеСкидокНаценокПоНоменклатуре/ДействиеСкидокНаценокПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4ff6c3c4-9bf3-4880-b594-fccf5875e951">
  <name>ДействиеСкидокНаценокПоНоменклатуре</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="287daa44-2119-47ad-a8c8-f6e16ddbacea">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c09ba11e-7348-40ca-a357-74d1ff6e3259">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="89e99e2d-c45c-467c-a13d-98adfc010d4b">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="06843c48-39be-4ba8-8fb6-b26e30adcdf0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/НоменклатураЗагруженнаяНаТСД/НоменклатураЗагруженнаяНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураЗагруженнаяНаТСД</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменДаннымиМобильноеПриложение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

UT_Marketplaces.Marketplaces/src/CommonModules/РаботаСоСправочниками/Module.bsl
Функция ПолучитьСкидки(Номенклатура, Характеристика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидокНаценокПоНоменклатуре.Источник.Наименование КАК Источник
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценокПоНоменклатуре КАК ДействиеСкидокНаценокПоНоменклатуре
		|ГДЕ
		|	ДействиеСкидокНаценокПоНоменклатуре.Номенклатура = &Номенклатура
		|	И ДействиеСкидокНаценокПоНоменклатуре.Характеристика = &Характеристика
		|	И ДействиеСкидокНаценокПоНоменклатуре.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСкидок = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСкидок.Добавить(ВыборкаДетальныеЗаписи.Источник);
	КонецЦикла;                                                
	
	Возврат МассивСкидок;	
	
КонецФункции

Функция ПолучитьФотоНоменклатуры(Номенклатура) Экспорт
	Если НЕ Номенклатура.ФайлКартинки = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка() Тогда 
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Номенклатура.ФайлКартинки, Ложь);
		Если НЕ ДвоичныеДанные = Неопределено Тогда 
			Возврат Base64Строка(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
КонецФункции 

Функция ПолучитьДанныеУпаковокПоНоменклатуре(Номенклатура) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных=Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ПолучитьСтруктуруУпаковки(ВыборкаДетальныеЗаписи.Упаковка));
	КонецЦикла;
	
    Возврат МассивДанных;

КонецФункции // ПолучитьДанныеУпаковокПоНоменклатуре()

Функция ПолучитьСтруктуруНоменклатуры(Номенклатура) Экспорт 
	МассивНоменклатуры=Новый Массив;
	МассивНоменклатуры.Добавить(Номенклатура);     
	Если Не Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		ФоновыеЗаданияСервер.ВыполнитьДобавлениеМассиваНоменклатурыВРегистрОбменаС_ТСД_В_ФоновомЗадании(МассивНоменклатуры);
	КонецЕсли;
	
	Реквизиты="Наименование,ВидНоменклатуры,ЕдиницаИзмерения,Артикул";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,Реквизиты); 
	//СтруктураВозврата.ЕдиницаИзмерения=ПолучитьСтруктуруУпаковки(СтруктураВозврата.ЕдиницаИзмерения); 
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Номенклатура);

	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруНоменклатуры() 

Функция ПолучитьСтруктуруХарактеристики(Характеристика) Экспорт 	
	
	Реквизиты="Наименование,Владелец,НаименованиеПолное";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Характеристика,Реквизиты);
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Характеристика);
	
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруХарактеристики()  

Функция ПолучитьМассивХарактеристикПоНоменклатуре(Номенклатура) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	МассивВозврата=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = ПолучитьСтруктуруХарактеристики(Выборка.Ссылка);
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
		
	Возврат МассивВозврата	

КонецФункции // ПолучитьМассивХарактеристикПоНоменклатуре()

Функция ПолучитьСтруктуруУпаковки(Упаковка) Экспорт
	
	Реквизиты="Код,Наименование,ЕдиницаИзмерения,Владелец";
	
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Упаковка,Реквизиты); 
	
	СтруктураВозврата = ДобавитьСсылкуНаСправочникВНачалоСтруктуры(СтруктураВозврата,Упаковка);
	
	КоэффициентУпаковки=Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Упаковка,СтруктураВозврата.Владелец);
	Если КоэффициентУпаковки=Неопределено Тогда
		КоэффициентУпаковки=1;	
	КонецЕсли;	
	СтруктураВозврата.Вставить("КоэффициентУпаковки",КоэффициентУпаковки); 
	
	Если ТипЗнч(СтруктураВозврата.Владелец)=Тип("СправочникСсылка.НаборыУпаковок") Тогда
		СтруктураВозврата.Владелец=Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьСтруктуруУпаковки()

Функция ПолучитьМассивУпаковокПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	МассивВозврата=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата = ПолучитьСтруктуруУпаковки(Выборка.Ссылка);
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
		
	Возврат МассивВозврата	

КонецФункции // ПолучитьМассивУпаковокПоНоменклатуре()

Функция ПолучитьСтруктуруШтрихкода(Штрихкод) Экспорт
	
	СтруктураВозврата=ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Штрихкод,Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьМассивШтрихкодовПоНоменклатуре()

Функция ПолучитьМассивШтрихкодовПоНоменклатуре(Номенклатура) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,	
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	СтруктураВозврата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ); 
		
	Возврат СтруктураВозврата	

КонецФункции // ПолучитьМассивШтрихкодовПоНоменклатуре()



Функция ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Номенклатура) Экспорт
	Если НЕ Константы.ЗагружатьВсюНоменклатуруВТСД.Получить() Тогда
		НоменклатураЗагружаетсяНаУзел=РегистрыСведений.НоменклатураЗагруженнаяНаТСД.НоменклатураЗагружаетсяНаУзел(Номенклатура,ПараметрыСеанса.ТекущийУзелТСД);
		Если НЕ НоменклатураЗагружаетсяНаУзел Тогда
			СтруктураВозврата=Новый Структура;
			СтруктураВозврата.Вставить("Номенклатура",ПолучитьСтруктуруНоменклатуры(Номенклатура));
			СтруктураВозврата.Вставить("Характеристки",ПолучитьМассивХарактеристикПоНоменклатуре(Номенклатура));
		    СтруктураВозврата.Вставить("Упаковки",ПолучитьМассивУпаковокПоНоменклатуре(Номенклатура));
			СтруктураВозврата.Вставить("Штрихкода",ПолучитьМассивШтрихкодовПоНоменклатуре(Номенклатура));
		
			Возврат СтруктураВозврата
		Иначе 
			Возврат Номенклатура;
		КонецЕсли;
	Иначе
		Возврат Номенклатура;
	КонецЕсли;
	
КонецФункции // ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре()



Процедура СтруктуруВЗаписьXML(ЗаписьXML,Структура) Экспорт
	
	Для Каждого СтрокаСтруктуры из Структура Цикл
        
		ЗаписатьXML(ЗаписьXML, СтрокаСтруктуры.Значение, СтрокаСтруктуры.Ключ, НазначениеТипаXML.Явное); 
		
	КонецЦикла;

КонецПроцедуры // СтруктуруВЗаписьXML()

Функция ДобавитьСсылкуНаСправочникВНачалоСтруктуры(Структура,Ссылка)
	СтруктураНовая=Новый Структура;
	СтруктураНовая.Вставить("Ссылка",Ссылка);
	Для Каждого СтрокаСтруктуры из Структура Цикл

		СтруктураНовая.Вставить(СтрокаСтруктуры.Ключ,СтрокаСтруктуры.Значение); 
		
	КонецЦикла; 
	Возврат СтруктураНовая;
КонецФункции
